_posts/2017-06-07-Spark-Ensime-SBT-Notes.html
---
layout : post
title : Spark Ensime SBT Notes
categories : Spark
tags : spark sbt
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">sbt run 报错： Uncaught exception in thread SparkListenerBus</a>
<ul>
<li><a href="#sec-1-1">表现</a></li>
<li><a href="#sec-1-2">原因</a></li>
<li><a href="#sec-1-3">解决方法</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
简单记录一下折腾 Spark, Ensime, sbt 过程中遇到的问题。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">sbt run 报错： Uncaught exception in thread SparkListenerBus</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">表现</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-text">15/02/06 15:56:49 ERROR Utils: Uncaught exception in thread SparkListenerBus
java.lang.InterruptedException
    at java.util.concurrent.locks.AbstractQueuedSynchronizer.doAcquireSharedInterruptibly(AbstractQueuedSynchronizer.java:996)
    at java.util.concurrent.locks.AbstractQueuedSynchronizer.acquireSharedInterruptibly(AbstractQueuedSynchronizer.java:1303)
    at java.util.concurrent.Semaphore.acquire(Semaphore.java:317)
    at org.apache.spark.scheduler.LiveListenerBus$$anon$1$$anonfun$run$1.apply$mcV$sp(LiveListenerBus.scala:48)
    at org.apache.spark.scheduler.LiveListenerBus$$anon$1$$anonfun$run$1.apply(LiveListenerBus.scala:47)
    at org.apache.spark.scheduler.LiveListenerBus$$anon$1$$anonfun$run$1.apply(LiveListenerBus.scala:47)
    at org.apache.spark.util.Utils$.logUncaughtExceptions(Utils.scala:1460)
    at org.apache.spark.scheduler.LiveListenerBus$$anon$1.run(LiveListenerBus.scala:46)
15/02/06 15:56:49 ERROR ContextCleaner: Error in cleaning thread
java.lang.InterruptedException
    at java.lang.Object.wait(Native Method)
    at java.lang.ref.ReferenceQueue.remove(ReferenceQueue.java:135)
    at org.apache.spark.ContextCleaner$$anonfun$org$apache$spark$ContextCleaner$$keepCleaning$1.apply$mcV$sp(ContextCleaner.scala:136)
    at org.apache.spark.ContextCleaner$$anonfun$org$apache$spark$ContextCleaner$$keepCleaning$1.apply(ContextCleaner.scala:134)
    at org.apache.spark.ContextCleaner$$anonfun$org$apache$spark$ContextCleaner$$keepCleaning$1.apply(ContextCleaner.scala:134)
    at org.apache.spark.util.Utils$.logUncaughtExceptions(Utils.scala:1460)
    at org.apache.spark.ContextCleaner.org$apache$spark$ContextCleaner$$keepCleaning(ContextCleaner.scala:133)
    at org.apache.spark.ContextCleaner$$anon$3.run(ContextCleaner.scala:65)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">原因</h3>
<div class="outline-text-3" id="text-1-2">
<p>
SparkSession、SparkContext 没有关闭
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">解决方法</h3>
<div class="outline-text-3" id="text-1-3">
<p>
下面两者均可：
</p>

<ul class="org-ul">
<li>添加 <code>sc.stop()</code> 或者 <code>spark.stop()</code>
</li>
<li>build.sbt 里面添加：
<div class="org-src-container">

<pre class="src src-scala">fork := <span style="color: #7fffd4; font-weight: bold;">true</span>
</pre>
</div>
</li>
</ul>
</div>
</div>
</div>
